In [38]:
import pandas as pd

In [45]:
df = pd.read_csv('Untitled spreadsheet - Sheet1.csv', index_col = 0)
print(df)

    name  age
1    Gor   17
2   Hamo   18
3  Narek   16

In [49]:
df = pd.read_json("test.json")
df

        apples  Oranges
Rosie        3        0
Robert       2        3
Lily         0        7
David        1        2

In [51]:
df.Oranges.Lily = 8
df

        apples  Oranges
Rosie        3        0
Robert       2        3
Lily         0        8
David        1        2

In [52]:
df.to_csv("test.csv")
df

        apples  Oranges
Rosie        3        0
Robert       2        3
Lily         0        8
David        1        2

In [54]:
df.to_json("newtest.json")
df

        apples  Oranges
Rosie        3        0
Robert       2        3
Lily         0        8
David        1        2

In [55]:
df.info()
df

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Rosie to David
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   apples   4 non-null      int64
 1   Oranges  4 non-null      int64
dtypes: int64(2)
memory usage: 268.0+ bytes

        apples  Oranges
Rosie        3        0
Robert       2        3
Lily         0        8
David        1        2

In [56]:
df.shape

(4, 2)

In [61]:
temp_df = pd.concat([df, df])

In [62]:
temp_df

        apples  Oranges
Rosie        3        0
Robert       2        3
Lily         0        8
David        1        2
Rosie        3        0
Robert       2        3
Lily         0        8
David        1        2

In [64]:
temp_df.shape

(8, 2)

In [65]:
temp_df = temp_df.drop_duplicates()

In [72]:
temp_df

        apples  Oranges
Rosie        3        0
Robert       2        3
Lily         0        8
David        1        2

In [73]:
df.rename(columns = {'apples': 'bananas'}, inplace = True)